Repository: laurentbarraud/Recipe-Writer
Catalog: Recipe-Writer/Recipe-Writer/strings.*.resx
Languages: fr

# ErrorEmptyFields
source: Please fill in all fields.
fr: Veuillez remplir tous les champs.

# ErrorIngredientAdd
source: Error while adding ingredient : {0}
fr: Erreur pendant l'ajout de l'ingrédient : {0}

# ErrorIngredientInsert
source: Error inserting an ingredient : {0}
fr: Erreur lors de l'insertion d'un ingrédient :{0}

# ErrorMaxIngredientsNbReached
source: Maximum number of ingredients for the recipe reached.
fr: Nombre maximum d'ingrédients pour la recette atteint.

# ErrorMustEnterValidNumberForTimeCompletion
source: Please enter a valid number for the time of completion of the recipe
fr: Veuillez saisir un nombre valide pour le temps de réalisation de la recette

# ErrorNotANumber
source: Please enter a valid actual number for the quantity of the ingredient.
fr: Veuillez entrer un nombre réel valide pour la quantité de l'ingrédient.

source: New ingredient inserted into base.
fr: Nouvel ingrédient inséré dans la base.

# ErrorMustEnterACompletionTime
source: Please enter a completion time for the recipe.
fr: Veuillez saisir un temps de réalisation pour la recette.

# ErrorMustEnterATitle
source: Please enter a title for the recipe
fr: Veuillez saisir un titre pour la recette.

# ConfirmDeleteIngredientFromDB
source: Remove this ingredient definitely ?
fr: Supprimer définitivement cet ingrédient ?

source: Confirm deletion
fr: Confirmer la suppression

# ErrorDatabaseCorrupted
source: The database is corrupted.
fr: La base de donnée est corrompue.

# DBfileNotFound
source: Database file not found.
fr: Le fichier de la base de donnée n'a pas été trouvé.

# DBWillBeBuiltWithInitialData
source: The database will be built with the initial data.
fr: La base va être construite avec les données initiales.

# ErrorMustEnterAtLeastOneIngredient
source: Please enter at least one ingredient.
fr: Veuillez entrer au moins un ingrédient.

# ConfirmDeleteInstruction
source: Really delete the instruction ?
fr: Vous souhaitez vraiment supprimer l'instruction ?

# ErrorNoIngredientSelected
source: No ingredient was selected
fr: Aucun ingrédient n'a été sélectionné

# ConfirmDeleteDisplayedRecipeFromDB
source: Really delete the displayed recipe?
fr: Voulez-vous vraiment supprimer définitivement la recette affichée ?

source: Preparation :
fr: Préparation :

source: Necessary ingredients
fr: Ingrédients nécessaires

# InfoRecipeExported
source: The recipe has been successfully exported !
fr: La recette a été exportée avec succès !

# ErrorExport
source: Error during export : {0}
fr: Erreur lors de l'exportation : {0}

# InfoAmountOfIngredientsNeededDeducted
source: The amount of ingredients needed to make this recipe has been deducted.
fr: La quantité d’ingrédients nécessaire pour réaliser cette recette a été déduite.

source: Deduction from inventory
fr: Déduction de l'inventaire

# ErrorMustUseOnlyLettersForTheFileName
source: Please use only letters from A to Z without accents, hyphens, underscores or numbers for the file name.
fr: Veuillez utiliser uniquement les lettres de A à Z sans accents, tirets, traits de soulignement ou chiffres pour le nom du fichier.

# ConfirmKeepOldImageFile
source: Keep the old image file ?
fr: Conserver le fichier de l'ancienne image ?

# ErrorMustEnterATitleForNewRecipe
source: Please enter a title for the new recipe.
fr: Veuillez saisir un titre pour la nouvelle recette.

# LicenceVersion
source: Version 1.1 - April 2025
fr: v.1.1.1 - Décembre 2025

# LicenceAuthor
source: Created by Laurent Barraud
fr: Créé par Laurent Barraud.

# SearchResults
source: Results :
fr: Résultats :

# BaseWillBeRebuilt
source: The base will be rebuilt.
fr: La base va être reconstruite.

# ToolTipRecipeReadyToCookStatusText
source: Indicates if you have enough ingredients to make the recipe.
fr: Indique si vous avez assez d'ingrédients pour faire la recette.
